app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.create(favorite_params)
---
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2021-01-24 10:01:09.409332"], ["updated_at", "2021-01-24 10:01:09.409332"]]