app/controllers/posts_controller.rb

SELECT "areas".* FROM "areas"
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."area_id" = ?  [["area_id", 6]]
---
  def index
    @areas = Area.all
    if params[:post_or_area] == "true"
      @area = Area.find(params[:area_id])
      @posts = @area.posts
    else
      @posts = Post.all

SELECT "areas".* FROM "areas"
---
  def new
    @post = Post.new
    @areas = Area.all

SELECT "areas".* FROM "areas"
INSERT INTO "posts" ("user_id", "image_id", "title", "body", "created_at", "updated_at", "area_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "posts".* FROM "posts"
---
  def create
    @post = Post.new(post_params)
    @areas = Area.all
    @post.user_id = current_user.id
   if @post.save!

      redirect_to posts_path(@post.id)
   else
      @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "areas".* FROM "areas"
---
  def edit
    @post = Post.find(params[:id])
    @areas = Area.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "image_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_id", "ced99e0c0f96a36597aab15b4b81ba3daece10956a20767b3e2bfc3ae093"], ["updated_at", "2021-01-24 07:37:04.119718"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)